In [1]:
import pandas as pd

In [2]:
#All the csv for the capstone project 
# artist_df = pd.read_csv('artist.csv')
# image_link_df = pd.read_csv('image_link.csv') 
# museum_df = pd.read_csv('museum.csv') 
# museum_hours_df = pd.read_csv('museum_hours.csv') 
# product_size_df = pd.read_csv('product_size.csv') 
# subject_df = pd.read_csv('subject.csv') 
# work_df = pd.read_csv('work.csv') 
# canvas_size_df = pd.read_csv('canvas_size.csv')

#  Data cleaning for  Artist

In [3]:
artist_df = pd.read_csv('artist.csv')

In [4]:
#Checking for first 5 rows using head function.
artist_df.head()

,artist_id,full_name,first_name,middle_names,last_name,nationality,style,birth,death
0,500,Pierre-Auguste Renoir,Pierre,Auguste,Renoir,French,Impressionist,1841,1919
1,501,Alexandre Cabanel,Alexandre,NaN,Cabanel,French,Classicist,1823,1889
2,502,James Ensor,James,NaN,Ensor,Belgian,Expressionist,1860,1949
3,503,Maximilien Luce,Maximilien,NaN,Luce,French,Pointillist,1858,1941
4,504,August Macke,August,NaN,Macke,German,Expressionist,1887,1914

In [5]:
# Checking for total number of rows and columns using shape function
artist_df.shape

(421, 9)

In [6]:
# Checking for columns names for the artist table 
artist_df.columns

Index(['artist_id', 'full_name', 'first_name', 'middle_names', 'last_name',
       'nationality', 'style', 'birth', 'death'],
      dtype='object')

In [7]:
# Checking for datatyes for each of the columns using dtypes function
artist_df.dtypes

artist_id        int64
full_name       object
first_name      object
middle_names    object
last_name       object
nationality     object
style           object
birth            int64
death            int64
dtype: object

In [8]:
# Checking for non-nulls,count,dtype for each of the columns for the artist table 
artist_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421 entries, 0 to 420
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   artist_id     421 non-null    int64
 1   full_name     421 non-null    object
 2   first_name    421 non-null    object
 3   middle_names  148 non-null    object
 4   last_name     421 non-null    object
 5   nationality   421 non-null    object
 6   style         421 non-null    object
 7   birth         421 non-null    int64
 8   death         421 non-null    int64
dtypes: int64(3), object(6)
memory usage: 29.7+ KB

In [9]:
# Checking for missing values in each of the column for the artist table  
artist_df.isnull().sum()

artist_id         0
full_name         0
first_name        0
middle_names    273
last_name         0
nationality       0
style             0
birth             0
death             0
dtype: int64

In [15]:
# Removing Middle names column as it will not be used for analysis.
artist_df = artist_df.drop('middle_names', axis=1)

In [16]:
#Checking if the blanks are filled with ' '
artist_df.head(10)

,artist_id,full_name,first_name,last_name,nationality,style,birth,death
0,500,Pierre-Auguste Renoir,Pierre,Renoir,French,Impressionist,1841,1919
1,501,Alexandre Cabanel,Alexandre,Cabanel,French,Classicist,1823,1889
2,502,James Ensor,James,Ensor,Belgian,Expressionist,1860,1949
3,503,Maximilien Luce,Maximilien,Luce,French,Pointillist,1858,1941
4,504,August Macke,August,Macke,German,Expressionist,1887,1914
5,505,Thomas Gainsborough,Thomas,Gainsborough,English,Rococo,1727,1788
6,506,Julien Dupré,Julien,Dupre,French,Naturalist,1851,1910
7,507,George Catlin,George,Catlin,American,American West,1796,1872
8,508,Federico Zandomeneghi,Federico,Zandomeneghi,Italian,Expressionist,1841,1917
9,509,Cornelis Springer,Cornelis,Springer,Dutch,Landscape Art,1817,1891

In [17]:
#Checking for unique values in each of the column 
artist_df.nunique()

artist_id      421
full_name      421
first_name     219
last_name      414
nationality     18
style           35
birth          223
death          216
dtype: int64

In [18]:
#Checking for duplicates in each of the columns
artist_df.duplicated('artist_id').sum()
artist_df.duplicated('full_name').sum()
# Fist name  contains duplicates. 
artist_df.duplicated('first_name').sum()
##Last name contains duplicates
artist_df.duplicated('last_name').sum()
#Nationality column contains duplciates
artist_df.duplicated('nationality').sum()
#style column contains duplciates
artist_df.duplicated('style').sum()
#birth column contains duplciates
artist_df.duplicated('birth').sum()
#death column contains duplciates           
artist_df.duplicated('death').sum()

# 'artist_id' and ''full_name' are the columns containing unique values which are important for the analysis. 
# 'first_name','last_name' contains duplicates which are ignored since full names are unique.
# 'nationality' contains duplicates but it is differentiated based on each unique 'artist_id'.
# 'style' contains duplicates but it is differentiated based on each unique 'artist_id'.
# 'birth'  contains duplicates but it is differentiated based on each unique 'artist_id'.
# 'death' contains duplicates but it is differentiated based on each unique 'artist_id'.

205

In [19]:
artist_df.to_csv('artist_clean.csv', encoding='utf-8')

#  Data cleaning for Image_link

In [20]:
image_link_df = pd.read_csv('image_link.csv')

In [21]:
#Checking for first 5 rows using head function.
image_link_df.head(5)

,work_id,url,thumbnail_small_url,thumbnail_large_url
0,181978,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
1,173188,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
2,194065,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
3,129337,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
4,141073,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...

In [22]:
# Checking for total number of rows and columns using shape function
image_link_df.shape

(14775, 4)

In [23]:
# Checking for columns names for the image_link table 
image_link_df.columns

Index(['work_id', 'url', 'thumbnail_small_url', 'thumbnail_large_url'], dtype='object')

In [24]:
# Checking for datatyes for each of the columns using dtypes function
image_link_df.dtypes

work_id                 int64
url                    object
thumbnail_small_url    object
thumbnail_large_url    object
dtype: object

In [25]:
# Checking for non-nulls,count,dtype for each of the columns for the image_link table 
image_link_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14775 entries, 0 to 14774
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   work_id              14775 non-null  int64
 1   url                  14775 non-null  object
 2   thumbnail_small_url  14773 non-null  object
 3   thumbnail_large_url  14773 non-null  object
dtypes: int64(1), object(3)
memory usage: 461.8+ KB

In [26]:
# CHecking for missing values 
image_link_df.isnull().sum()

work_id                0
url                    0
thumbnail_small_url    2
thumbnail_large_url    2
dtype: int64

In [27]:
# Using 'fillna' for the 'thumbnail_small_url'  to remove blanks for the image_link table
image_link_df['thumbnail_small_url'].fillna('NaN',inplace=True)
image_link_df.isnull().sum()

# Using 'fillna' for the 'thumbnail_large_url'  to remove blanks for the image_link table
image_link_df['thumbnail_large_url'].fillna('NaN',inplace=True)
image_link_df.isnull().sum()

work_id                0
url                    0
thumbnail_small_url    0
thumbnail_large_url    0
dtype: int64

In [28]:
# Checking for duplicates for image_link
image_link_df.duplicated('work_id').sum()
#  There are 60 duplicates for work_id. It will be ignored as it is not going to affect the analysis.
image_link_df.duplicated('url').sum()
#  There are 60 duplicates for url. It will be ignored as it is not going to affect affect the analysis.
image_link_df.duplicated('thumbnail_small_url').sum()
#  There are 61 duplicates for thumbnail_small_url. It will be ignored as it is not going to affect affect the analysis.
image_link_df.duplicated('thumbnail_large_url').sum()
#  There are 61 duplicates for thumbnail_large_url. It will be ignored as it is not going to affect affect the analysis.

61

In [29]:
#removing the duplicates from work_id,url,thumbnail_small_url,thumbnail_large_url
image_link_df= image_link_df.drop_duplicates()

In [30]:
# Checking for duplicates for image_link
image_link_df.duplicated('work_id').sum()
# Duplicates removed
image_link_df.duplicated('url').sum()
# Duplicates removed
image_link_df.duplicated('thumbnail_small_url')
#  There are 1 duplicates as NaN. It will be ignored as it is not going to affect affect the analysis.
image_link_df.duplicated('thumbnail_large_url').sum()
#  There are 1 duplicates as NaN. It will be ignored as it is not going to affect affect the analysis.

1

In [31]:
#Checking for unique values in each of the column 
image_link_df.nunique()

work_id                14715
url                    14715
thumbnail_small_url    14714
thumbnail_large_url    14714
dtype: int64

In [32]:
image_link_df.to_csv('image_link_clean.csv', encoding='utf-8')

#  Data cleaning for museum_hours

In [33]:
museum_hours_df = pd.read_csv('museum_hours.csv')

In [34]:
museum_hours_df.head(5)

   museum_id        day      open     close
0         30     Sunday  10:30:AM  05:30:PM
1         30     Monday  10:30:AM  05:30:PM
2         30    Tuesday  10:30:AM  05:30:PM
3         30  Wednesday  10:30:AM  05:30:PM
4         30    Thusday  10:30:AM  05:30:PM

In [35]:
# Checking for total number of rows and columns using shape function
museum_hours_df.shape

(351, 4)

In [36]:
# Checking for columns names for the museum_hours table 
museum_hours_df.columns

Index(['museum_id', 'day', 'open', 'close'], dtype='object')

In [37]:
# Checking for datatyes for each of the columns using dtypes function
museum_hours_df.dtypes

museum_id     int64
day          object
open         object
close        object
dtype: object

In [38]:
# Checking for non-nulls,count,dtype for each of the columns for the museum_hours table 
museum_hours_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   museum_id  351 non-null    int64
 1   day        351 non-null    object
 2   open       351 non-null    object
 3   close      351 non-null    object
dtypes: int64(1), object(3)
memory usage: 11.1+ KB

In [39]:
#Checking for unique values in each of the column 
museum_hours_df.nunique()

museum_id    57
day           8
open         11
close        15
dtype: int64

In [40]:
#Checking for missing values for each column in musesum hours
museum_hours_df.isnull().sum()

museum_id    0
day          0
open         0
close        0
dtype: int64

In [41]:
#Checking for duplicates in each of the columns
museum_hours_df.duplicated('museum_id').sum()
# museum id duplicates are acceptabe as for every museum id there are multiple rows which  describe the musesum opening hours

294

In [42]:
# Checking for days column for museum_hours table
# Number of days are 8. 
# Thursday is repeated twice with two different spellings.
museum_hours_df.day

0         Sunday
1         Monday
2        Tuesday
3      Wednesday
4        Thusday
         ...
346      Tuesday
347    Wednesday
348     Thursday
349       Friday
350     Saturday
Name: day, Length: 351, dtype: object

In [43]:
# Changing the spelling of Thursday 
museum_hours_df['day'].str.replace('Thusday','Thursday')
museum_hours_df.head(20)

    museum_id        day      open     close
0          30     Sunday  10:30:AM  05:30:PM
1          30     Monday  10:30:AM  05:30:PM
2          30    Tuesday  10:30:AM  05:30:PM
3          30  Wednesday  10:30:AM  05:30:PM
4          30    Thusday  10:30:AM  05:30:PM
5          30     Friday  10:30:AM  05:30:PM
6          30   Saturday  10:30:AM  07:00:PM
7          31     Sunday  11:00:AM  06:00:PM
8          31     Monday  11:00:AM  06:00:PM
9          31    Tuesday  11:00:AM  06:00:PM
10         31  Wednesday  11:00:AM  06:00:PM
11         31    Thusday  11:00:AM  06:00:PM
12         31     Friday  11:00:AM  06:00:PM
13         31   Saturday  11:00:AM  06:00:PM
14         32     Sunday  10:00:AM  05:00:PM
15         32     Monday  10:00:AM  05:00:PM
16         32    Tuesday  10:00:AM  05:00:PM
17         32  Wednesday  10:00:AM  05:00:PM
18         32    Thusday  10:00:AM  05:00:PM
19         32     Friday  10:00:AM  05:00:PM

In [44]:
museum_hours_df.to_csv('museum_hours_clean.csv', encoding='utf-8')

#  Data cleaning for product_size

In [45]:
product_size_df = pd.read_csv('product_size.csv')

In [46]:
product_size_df.head(5)

   work_id size_id  sale_price  regular_price
0   160228      24          85             85
1   160228      30          95             95
2   160236      24          85             85
3   160236      30          95             95
4   160244      24          85             85

In [47]:
# Checking for total number of rows and columns using shape function
product_size_df.shape

(110347, 4)

In [48]:
# Checking for columns names for the product size table 
product_size_df.columns

Index(['work_id', 'size_id', 'sale_price', 'regular_price'], dtype='object')

In [49]:
# Checking for non-nulls,count,dtype for each of the columns for the product size table 
product_size_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110347 entries, 0 to 110346
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   work_id        110347 non-null  int64
 1   size_id        110347 non-null  object
 2   sale_price     110347 non-null  int64
 3   regular_price  110347 non-null  int64
dtypes: int64(3), object(1)
memory usage: 3.4+ MB

In [50]:
#Checking for unique values in each of the column 
product_size_df.nunique()

work_id          14630
size_id            164
sale_price         113
regular_price      157
dtype: int64

In [51]:
#missing values check
product_size_df.isnull().sum()

work_id          0
size_id          0
sale_price       0
regular_price    0
dtype: int64

In [52]:
# Checking for duplicates in product size
product_size_df.duplicated('work_id').sum()
#95717 duplicates in ('work_id') . This is acceptable as a single work id can have many sizes
product_size_df.duplicated('size_id').sum()
#110183 duplicates in ('size_id'). This is acceptable as same size id is valid for multiple paintings
product_size_df.duplicated('sale_price').sum()
#110234 duplicates in ('sale_price'). This is acceptable as same sales price is valid for multiple paintings
product_size_df.duplicated('regular_price').sum()
#110190 duplicates in ('regular_price'). This is acceptable as same regular price is valid for multiple paintings

110190

In [53]:
product_size_df.to_csv('product_size_clean.csv', encoding='utf-8')

#  Data cleaning for subject

In [54]:
subject_df = pd.read_csv('subject.csv')

In [55]:
subject_df.head(5)

   work_id     subject
0   160228  Still-Life
1   160236  Still-Life
2   160244  Still-Life
3   160252  Still-Life
4   160260  Still-Life

In [56]:
# Checking for total number of rows and columns using shape function
subject_df.shape

(6771, 2)

In [57]:
# Checking for columns names for the subject table 
subject_df.columns

Index(['work_id', 'subject'], dtype='object')

In [58]:
# Checking for datatyes for each of the columns using dtypes function
subject_df.dtypes

work_id     int64
subject    object
dtype: object

In [59]:
#missing values check
subject_df.isnull().sum()

work_id    0
subject    0
dtype: int64

In [60]:
#Checking for duplicates in each of the columns
subject_df.duplicated().sum()
# There are 59 duplicates in work_id. Keeping the duplicates as it is since a single work id can have multiple subjects.

59

In [61]:
#Checking for unique values in each of the column 
subject_df.nunique()

work_id    6008
subject      29
dtype: int64

In [62]:
subject_df.to_csv('subject_clean.csv', encoding='utf-8')

#  Data cleaning for canvas_size

In [63]:
canvas_size_df = pd.read_csv('canvas_size.csv')

In [64]:
canvas_size_df.head(10)

   size_id  width  height                     label
0       20     20     NaN             20" Long Edge
1       24     24     NaN             24" Long Edge
2       30     30     NaN             30" Long Edge
3       36     36     NaN             36" Long Edge
4       40     40     NaN             40" Long Edge
5       48     48     NaN             48" Long Edge
6       56     56     NaN             56" Long Edge
7     1522     15    22.0  15" x 22"(38 cm x 56 cm)
8     1618     16    18.0  16" x 18"(41 cm x 46 cm)
9     1620     16    20.0  16" x 20"(41 cm x 51 cm)

In [65]:
# Checking for total number of rows and columns using shape function
canvas_size_df.shape

(200, 4)

In [66]:
# Checking for columns names for the subject table 
canvas_size_df.columns

Index(['size_id', 'width', 'height', 'label'], dtype='object')

In [67]:
# Checking for datatyes for each of the columns using dtypes function
canvas_size_df.dtypes

size_id      int64
width        int64
height     float64
label       object
dtype: object

In [68]:
#missing values check
canvas_size_df.isnull().sum()

size_id    0
width      0
height     7
label      0
dtype: int64

In [69]:
# The canvas_size.csv has a column 'size_id' which is supposed to be a unique 4 digit number
# On analysis, it has been observed that the first 7 rows do not have a correct size_id and have missing height. 
# This can be a manual error so we are deleting those rows as we cannot create a unique size_id on our own 
canvas_size_df.tail(5)

     size_id  width  height                       label
195     7963     79    63.0  79" x 63"(201 cm x 160 cm)
196     8040     80    40.0  80" x 40"(203 cm x 102 cm)
197     8051     80    51.0  80" x 51"(203 cm x 130 cm)
198     8959     89    59.0  89" x 59"(226 cm x 150 cm)
199     9648     96    48.0  96" x 48"(244 cm x 122 cm)

In [70]:
# the first 7 rows do not have a correct size_id and is missing height
canvas_size_df.head(10)

   size_id  width  height                     label
0       20     20     NaN             20" Long Edge
1       24     24     NaN             24" Long Edge
2       30     30     NaN             30" Long Edge
3       36     36     NaN             36" Long Edge
4       40     40     NaN             40" Long Edge
5       48     48     NaN             48" Long Edge
6       56     56     NaN             56" Long Edge
7     1522     15    22.0  15" x 22"(38 cm x 56 cm)
8     1618     16    18.0  16" x 18"(41 cm x 46 cm)
9     1620     16    20.0  16" x 20"(41 cm x 51 cm)

In [71]:
# delete the rows with wrong data

canvas_size_df.dropna(subset=['height'], inplace=True)

In [72]:
# verify the data has been removed
canvas_size_df.head(10)

    size_id  width  height                     label
7      1522     15    22.0  15" x 22"(38 cm x 56 cm)
8      1618     16    18.0  16" x 18"(41 cm x 46 cm)
9      1620     16    20.0  16" x 20"(41 cm x 51 cm)
10     1623     16    23.0  16" x 23"(41 cm x 58 cm)
11     1624     16    24.0  16" x 24"(41 cm x 61 cm)
12     1632     16    32.0  16" x 32"(41 cm x 81 cm)
13     1826     18    26.0  18" x 26"(46 cm x 66 cm)
14     1926     19    26.0  19" x 26"(48 cm x 66 cm)
15     1929     19    29.0  19" x 29"(48 cm x 74 cm)
16     2016     20    16.0  20" x 16"(51 cm x 41 cm)

In [73]:
# previously the row count was 200. after the cleaning it should be 193
canvas_size_df.shape

(193, 4)

In [74]:
canvas_size_df = canvas_size_df.reset_index(drop=True)

In [75]:
canvas_size_df.head(10)

   size_id  width  height                     label
0     1522     15    22.0  15" x 22"(38 cm x 56 cm)
1     1618     16    18.0  16" x 18"(41 cm x 46 cm)
2     1620     16    20.0  16" x 20"(41 cm x 51 cm)
3     1623     16    23.0  16" x 23"(41 cm x 58 cm)
4     1624     16    24.0  16" x 24"(41 cm x 61 cm)
5     1632     16    32.0  16" x 32"(41 cm x 81 cm)
6     1826     18    26.0  18" x 26"(46 cm x 66 cm)
7     1926     19    26.0  19" x 26"(48 cm x 66 cm)
8     1929     19    29.0  19" x 29"(48 cm x 74 cm)
9     2016     20    16.0  20" x 16"(51 cm x 41 cm)

In [76]:
# Checking for duplicates for canvas size
canvas_size_df.duplicated('size_id').sum()
# 0 duplicates for size_id
canvas_size_df.duplicated('width').sum()
# 141 duplicates width. Many paintings can have the same width so this duplicate is acceptable 
canvas_size_df.duplicated('height').sum()
#143 duplicates height. Many paintings can have the same height so this duplicate is acceptable
canvas_size_df.duplicated('label').sum()
# 0 duplicates for label

0

In [77]:
canvas_size_df.to_csv('canvas_size_clean.csv', encoding='utf-8')

# Data cleaning for musesum

In [78]:
museum_df = pd.read_csv('museum.csv')

In [79]:
museum_df.head(5)

,museum_id,name,address,city,state,postal,country,phone,url
0,30,The Museum of Modern Art,11 W 53rd St,New York,NY,10019,USA,+1 212 708-9400,https://www.moma.org/
1,31,Pushkin State Museum of Fine Arts,12 Ulitsa Volkhonka,Moscow,NaN,119019,Russia,+7 495 697-95-78,https://pushkinmuseum.art/
2,32,National Gallery of Victoria,180 St Kilda Rd,Melbourne,Victoria,3004,Australia,+61 (0)3 8620 2222,https://www.ngv.vic.gov.au/
3,33,São Paulo Museum of Art,"Av. Paulista, 1578 - Bela Vista",São Paulo,NaN,01310-200,Brazil,+55 11 3149-5959,https://masp.org.br/
4,34,The State Hermitage Museum,Palace Square,2,Sankt-Peterburg,190000,Russia,7 812 710-90-79,https://www.hermitagemuseum.org/wps/portal/her...

In [80]:
# Checking for total number of rows and columns using shape function
museum_df.shape

(57, 9)

In [81]:
# Checking for columns names for the museum table 
museum_df.columns

Index(['museum_id', 'name', 'address', 'city', 'state', 'postal', 'country',
       'phone', 'url'],
      dtype='object')

In [82]:
#Checking missing values for each of the column used in musesum table
museum_df['museum_id'].isnull().sum()
museum_df['name'].isnull().sum()
museum_df['address'].isnull().sum()
museum_df['city'].isnull().sum()
museum_df['state'].isnull().sum()
museum_df['postal'].isnull().sum()
museum_df['country'].isnull().sum()
museum_df['phone'].isnull().sum()
museum_df['url'].isnull().sum()

# Columns such as state and postal contains missing values and outliers. It is ignored as it is not used for the analysis. 
# Country column does not contains nulls and it is used for the analysis.

0

In [83]:
# Checking the city column from the musesum table
museum_df['city'].head(12)
# Since the city column contains outliers,the city column is ignored. We are going to use country column for the analysis.

0        New York
1          Moscow
2       Melbourne
3       São Paulo
4               2
5        New York
6           45128
7           38000
8           29000
9     Kansas City
10          75001
11         London
Name: city, dtype: object

In [84]:
# Checking the phone column from the musesum table
museum_df['phone'].head(15)
# There are formating errors in phone number columns. The column is ignored as it is not going to be utilized for the analysis.

0        +1 212 708-9400
1       +7 495 697-95-78
2     +61 (0)3 8620 2222
3       +55 11 3149-5959
4        7 812 710-90-79
5        +1 212 535-7710
6         49 201 8845000
7       33 4 76 63 44 44
8       33 2 98 95 45 20
9        +1 816 751-1278
10      33 1 40 20 50 50
11       44 20 8858 4422
12          617-267-9300
13        31 20 674 7000
14        972 2-670-8811
Name: phone, dtype: object

In [85]:
# Checking for duplicates for musesum table
museum_df.duplicated('museum_id').sum()
museum_df.duplicated('name').sum()
museum_df.duplicated('address').sum()
museum_df.duplicated('name').sum()
museum_df.duplicated('city').sum()
museum_df.duplicated('phone').sum()
museum_df.duplicated('state').sum()
museum_df.duplicated('postal').sum()
museum_df.duplicated('country').sum()
museum_df.duplicated('url').sum()

0

In [86]:
museum_df.to_csv('museum_clean.csv', encoding='utf-8')

# Data cleaning for the work

In [2]:
 work_df = pd.read_csv('work.csv')

In [3]:
work_df.head(5)

,work_id,name,artist_id,style,museum_id
0,160228,Still Life with Flowers and a Watch,615,Baroque,43.0
1,160236,Still Life with Fruit and a Beaker on a Cock's...,615,Baroque,43.0
2,160244,Still Life with Fruit and a Goldfinch,615,Baroque,43.0
3,160252,Still Life with Fruit and Oysters,615,Baroque,43.0
4,160260,"Still Life with Fruit, Oysters, and a Porcelai...",615,Baroque,43.0

In [4]:
# check for missing artist id in the work table
work_df['artist_id'].isnull().sum()

0

In [5]:
# check for missing work id in the work table
work_df['work_id'].isnull().sum()

0

In [7]:
#check for missing museum id in the work table
work_df['museum_id'].isnull().sum()
# blank museum_id is acceptable as it indicates that the work is not displayed in any musesum.

10223

In [6]:
# Using fillna for replacing the missing values in museum is in the work table
work_df['museum_id'].fillna(0,inplace=True)

In [7]:
# NaN value for a museum id means the work is not displayed in any museum.As a result, those rows will be ignored. 
work_df.head(15)

,work_id,name,artist_id,style,museum_id
0,160228,Still Life with Flowers and a Watch,615,Baroque,43.0
1,160236,Still Life with Fruit and a Beaker on a Cock's...,615,Baroque,43.0
2,160244,Still Life with Fruit and a Goldfinch,615,Baroque,43.0
3,160252,Still Life with Fruit and Oysters,615,Baroque,43.0
4,160260,"Still Life with Fruit, Oysters, and a Porcelai...",615,Baroque,43.0
5,160268,The Overturned Bouquet,615,Baroque,43.0
6,125752,Arabian Horses at Pasture,757,Baroque,0.0
7,125818,Count Halm on His Basedow Estate,757,Baroque,0.0
8,23448,Horses at the Porch,757,Baroque,34.0
9,125763,Napoleon Before the Burning City of Smolensk,757,Baroque,0.0
10,125774,Peasants Resting in the Field,757,Baroque,0.0
11,125785,Portrait Oberleutnant Theodor Von Klein,757,Baroque,0.0
12,125796,The Rescue of Count Munnich,757,Baroque,0.0
13,125807,The Stable Yard,757,Baroque,0.0
14,24532,Jacob A. Stamler Departing Le Havre,563,NaN,0.0

In [8]:
# Checking for duplicates 
work_df.duplicated('work_id').sum()

60

In [9]:
# As work_id contains duplicates , removing the duplicate will provide clarity in understanding the data.

work_df= work_df.drop_duplicates()

In [10]:
work_df.duplicated('work_id').sum()

0

In [11]:
work_df.duplicated('artist_id').sum()
# artist Id can be duplicated because a single artist can have multiple works

14295

In [12]:
work_df.duplicated('museum_id').sum()
# Museum Id can be duplicated because a single Artist can have multiple works which could be displayed at the same museum

14658

In [13]:
 work_df.to_csv('work_clean.csv', encoding='utf-8')